# 01 Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02 Turn project folder path into a string

In [2]:
path = r'C:\Users\nanu_\Documents\Career Foundry\Projects\2 Data Immersion\Python fundamental for Data Analysis\01-2024 Instacart Basket analysis'

In [3]:
path

'C:\\Users\\nanu_\\Documents\\Career Foundry\\Projects\\2 Data Immersion\\Python fundamental for Data Analysis\\01-2024 Instacart Basket analysis'

# Question 1: Data consistency checks for df_prods

## 03 Importing products.csv  dataset

In [4]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# 04 Mixed-Type Data

In [5]:
# Create a dataframe
df_test = pd.DataFrame()

In [6]:
# Create a mixed type column
df_test['mix'] = ['a','b', 1, True]

In [7]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [8]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df_test[weird]) > 0:
    print ("Column " + col + " has mixed data type")
else:
    print ("No columns with mixed datatype")

Column mix has mixed data type

In [9]:
# Changing data type of Column Mix
df_test['mix'] = df_test['mix'].astype('str')

# 05 Missing Values

In [10]:
# finding missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

#### The output shows there are 16 missing values in product_name Column

In [11]:
# to view 16 observations with missing values, we create a subset of the dataframe 
# # containing only the values product_name = nan
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [12]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [13]:
# df.describe()

# df['column with missings'].fillna(mean value, inplace=True)

# df_prods.median()

# df['column with missings'].fillna(median value, inplace=True)

In [14]:
# Checking the number of rows and columns before clean up
df_prods.shape

(49693, 5)

In [15]:
# extracting the observations from df_prods where product_name is nan and making new dataframe
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
# Checking the number of rows and columns after clean up
df_prods_clean.shape

(49677, 5)

In [17]:
#  drop all missing values from df_prods 

# df_prods.dropna(inplace=True)

# If you wanted to drop only the NaNs from a particular column.  Inplace=True with replace the existing dataframe with new.

# df_prods.dropna(subset='product_name',inplace=True)

# 06 Finding Duplicates

In [18]:
# extract duplicate observations from df_prods_clean and store it in dataframe df_dups
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

#### There are 5 Duplicate values in dataframe

In [20]:
df_prods.loc[df_prods['product_name']=="Fiber 4g Gummy Dietary Supplement"]

,product_id,product_name,aisle_id,department_id,prices
461,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8

In [21]:
df_prods.loc[df_prods['product_name']=='Ranger IPA']

       product_id product_name  aisle_id  department_id  prices
18458       18458   Ranger IPA        27              5     9.2
18459       18458   Ranger IPA        27              5     9.2

In [22]:
df_prods_clean.shape

(49677, 5)

In [23]:
# Removing Duplicates from df_prods_clean dataframe and storeing in df_prods_clean_no_dups 
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [24]:
df_prods_clean_no_dups.shape

(49672, 5)

In [25]:
Products_checked = df_prods_clean_no_dups

# 07 Exporting Cleaned Data

In [26]:
Products_checked.to_csv(os.path.join(path, '02 Data','Prepared Data', 'Products_checked.csv'), index= False)

## Task 4.5
## Question 2: Orders Table

In [27]:
#Bringing Orders Table that was previously wrangled
df_ords_2 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'Orders_wrangled.csv'), index_col = False)

In [28]:
#Checking the data
df_ords_2.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [29]:
# Calculating the descriptive statistics of each numeric column
df_ords_2.describe()

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### Based on the abpve descriptive analysis I don't see any inconsistency of data

## Question 3

In [30]:
# Checking for mixed data types columns in df_ords_2
for col in df_ords_2.columns.tolist():
  weird = (df_ords_2[[col]].applymap(type) != df_ords_2[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df_ords_2[weird]) > 0:
    print (col)
else :
    print ("No columns with mixed datatype")

No columns with mixed datatype

 ## Question 4
    There are no mixed_type data  in df_ords_2

## Question 5

In [31]:
# Checking the missing values df_ords_2 
df_ords_2.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
time_of_day                    0
days_since_prior_order    206209
dtype: int64

#### There are 206209 missing values in days_since_prior_order column

In [32]:
# Creating a subset of Dataframe to view 206209 observations with missing values
df_ords_nan = df_ords_2[df_ords_2['days_since_prior_order'].isnull() == True]

In [33]:
df_ords_nan

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [34]:
df_ords_2.shape

(3421083, 6)

### Handling Missing Values

Missing values in the orders table are only in "days_since_prior_order" column. If somebody is ordering for first time, it is logical that the column will have missing values because they don't have any past order. So we cannot remove those columns. To deal with this situation, I am creating a column to show if the order is first order or not. If the column has missing value, I will say it is first order, if not it is not the first order

In [35]:
df_ords_2['First_Order'] = np.where(df_ords_2['days_since_prior_order'].notnull(), 'Not First Order', 'First Order')

In [36]:
df_ords_2.head()

,order_id,user_id,order_number,orders_day_of_week,time_of_day,days_since_prior_order,First_Order
0,2539329,1,1,2,8,NaN,First Order
1,2398795,1,2,3,7,15.0,Not First Order
2,473747,1,3,3,12,21.0,Not First Order
3,2254736,1,4,4,7,29.0,Not First Order
4,431534,1,5,4,15,28.0,Not First Order

In [37]:
df_ords_2.shape

(3421083, 7)

# Question 7

In [38]:
# Checking the duplicates in df_ords_2
df_ords_2_dups = df_ords_2[df_ords_2.duplicated()]

In [39]:
df_ords_2_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, time_of_day, days_since_prior_order, First_Order]
Index: []

There are no duplicate values in the dataframe

# Question 8

    There was no need to address the duplicate values, as there were no duplicate values in the dataframe

# Question 9: Exporting to prepared data folder

In [40]:
df_ords_2.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'), index= False)